In [2]:
import pandas as pd
name=pd.read_csv('pandapractice1.csv')
name

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2

In [3]:
#to add new row
new_data_list=['def',1]
name.loc[4]=new_data_list
name

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1

In [4]:
name.loc[5]=['hap',23]
name

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1
5  hap   23

In [4]:
name.loc[3]

Name    imn
Age       2
Name: 3, dtype: object

In [5]:
name.head()

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1

In [6]:
name.loc[len('a2345678')]={'Age'32,'Name':'ert'}
name

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1
5  hap   23
8  ert   32

In [8]:
name.loc[len(name)]={'Name':'jlm','Age':3}   # when writing in curly brac specify column name
name

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1
5  hap   23
6  jlm    3
7  hap   23

In [8]:
name.loc[len(name)]=pd.Series({'Name':'gym','Age':21})
name

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1
5  hap   23
8  gym   21
7  jlm    3

In [9]:
name.append({'Name':'def','Age':31}, ignore_index=True)

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1
5  hap   23
6  gym   21
7  jlm    3
8  def   31

In [10]:
name.append({'Name':'def','Age':1}, ignore_index=True)

  Name  Age
0  abc   70
1  xyz   69
2  pqr    4
3  imn    2
4  def    1
5  hap   23
6  gym   21
7  jlm    3
8  def    1

In [12]:
name.index=[1,2,3,4,5,6,7,8]
name

  Name  Age
1  abc   70
2  xyz   69
3  pqr    4
4  imn    2
5  def    1
6  hap   23
7  gym   21
8  jlm    3

In [13]:
s=pd.Series({'Name':'hij','Age':3}, name=len(name))
s

Name    hij
Age       3
Name: 8, dtype: object

In [14]:
s1=pd.Series({'Name':'hij','Age':3},name=len(name))     #name mighty be use for index
s2=pd.Series({'Name':'lmn','Age':2},name='usa')
name.append([s1,s2])

    Name  Age
1    abc   70
2    xyz   69
3    pqr    4
4    imn    2
5    def    1
6    hap   23
7    gym   21
8    jlm    3
8    hij    3
usa  lmn    2

In [15]:
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [16]:
data=[['alok',10],['boby',12],['tilak',13]]
df=pd.DataFrame(data,columns=['Name','Age'])
df

    Name  Age
0   alok   10
1   boby   12
2  tilak   13

In [17]:
#floats
data=[['alok',10],['boby',12],['tilak',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

    Name   Age
0   alok  10.0
1   boby  12.0
2  tilak  13.0

In [18]:
#using dictionary
import pandas as pd
data={'Name':['tom','jack','steve','ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data)
df

    Name  Age
0    tom   28
1   jack   34
2  steve   29
3  ricky   42

In [21]:
df.index=['Rank1','Rank2','Rank3','Rank4']
df

        Name  Age
Rank1    tom   28
Rank2   jack   34
Rank3  steve   29
Rank4  ricky   42

In [23]:
d={'one':pd.Series([1,2,3], index=['a','b','c',]),
  'two':pd.Series([1,2,3,4], index=['d','f','g','h'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  NaN  1.0
f  NaN  2.0
g  NaN  3.0
h  NaN  4.0

In [24]:
d['one']

a    1
b    2
c    3
dtype: int64

In [31]:
df['two']

a    NaN
b    NaN
c    NaN
d    1.0
f    2.0
g    3.0
h    4.0
Name: two, dtype: float64

In [32]:
df[['one','two']]

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  NaN  1.0
f  NaN  2.0
g  NaN  3.0
h  NaN  4.0

In [64]:
d={'one':pd.Series([1,2,3], index=['a','b','c',]),
  'two':pd.Series([1,2,3,4], index=['a','b','c','d'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [59]:
#new_column=[10,20,30,'NaN']
#df['three']=new_column
#df

In [42]:
#new_column={'three':pd.series([10,20,30],index=['a','b','c']}
#df=new_column
#df

In [65]:
df['three']=pd.Series([10,20,30],index=['a','b','c'])
df

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [66]:
df['four']=df['two']+df['three']+df['one']+df['three']
df

   one  two  three  four
a  1.0    1   10.0  22.0
b  2.0    2   20.0  44.0
c  3.0    3   30.0  66.0
d  NaN    4    NaN   NaN

In [67]:
del df['one'] # for del column only
df

   two  three  four
a    1   10.0  22.0
b    2   20.0  44.0
c    3   30.0  66.0
d    4    NaN   NaN

In [68]:
df.pop('two')  # for del columns onlys not rows
df

   three  four
a   10.0  22.0
b   20.0  44.0
c   30.0  66.0
d    NaN   NaN

In [70]:
print(df.loc['b'])

three    20.0
four     44.0
Name: b, dtype: float64

In [71]:
print(df.iloc[2])   #only for rows

three    30.0
four     66.0
Name: c, dtype: float64

In [73]:
print(df[2:4])

   three  four
c   30.0  66.0
d    NaN   NaN

In [79]:
print(df.iloc[2:4])

   three  four
c   30.0  66.0
d    NaN   NaN

In [82]:
df=pd.DataFrame([[1,2],[3,4]], columns=['a','b'])
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df=df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [91]:
df=df.drop('a',axis=1)   #for rows and  for del columns write axis=1...by default it takes axis=0
df

   b
1  4
1  8

In [92]:
#accessing data from series with positions
s=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s[0]

1

In [93]:
s[:3]

a    1
b    2
c    3
dtype: int64

In [94]:
s[-3:]

c    3
d    4
e    5
dtype: int64

In [95]:
s[2:]

c    3
d    4
e    5
dtype: int64

In [96]:
s['a']

1

In [99]:
s[['a','c','d']]

a    1
c    3
d    4
dtype: int64

In [104]:
s['a':'d']   # getting value till d unlike index

a    1
b    2
c    3
d    4
dtype: int64

In [106]:
d={'Name':pd.Series(['ganesh','nilesh','rakesh','bibin','kalpak']),
  'Age':pd.Series([20,40,30,44,55]),
  'Rating':pd.Series([4.23,5.20,6.34,7.34,4.5])}
d

{'Name': 0    ganesh
 1    nilesh
 2    rakesh
 3     bibin
 4    kalpak
 dtype: object, 'Age': 0    20
 1    40
 2    30
 3    44
 4    55
 dtype: int64, 'Rating': 0    4.23
 1    5.20
 2    6.34
 3    7.34
 4    4.50
 dtype: float64}

In [108]:
df=pd.DataFrame(d)
df

     Name  Age  Rating
0  ganesh   20    4.23
1  nilesh   40    5.20
2  rakesh   30    6.34
3   bibin   44    7.34
4  kalpak   55    4.50

In [109]:
df.T   #converting rowsa nd columns

             0       1       2      3       4
Name    ganesh  nilesh  rakesh  bibin  kalpak
Age         20      40      30     44      55
Rating    4.23     5.2    6.34   7.34     4.5

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Name      5 non-null object
Age       5 non-null int64
Rating    5 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

In [112]:
df.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [122]:
df.shape

(5, 3)

In [114]:
df.size

15

In [115]:
df.values

array([['ganesh', 20, 4.23],
       ['nilesh', 40, 5.2],
       ['rakesh', 30, 6.34],
       ['bibin', 44, 7.34],
       ['kalpak', 55, 4.5]], dtype=object)

In [116]:
df.head()

     Name  Age  Rating
0  ganesh   20    4.23
1  nilesh   40    5.20
2  rakesh   30    6.34
3   bibin   44    7.34
4  kalpak   55    4.50

In [117]:
df.tail(3)

     Name  Age  Rating
2  rakesh   30    6.34
3   bibin   44    7.34
4  kalpak   55    4.50

In [118]:
df.sum()

Name      ganeshnileshrakeshbibinkalpak
Age                                 189
Rating                            27.61
dtype: object

In [119]:
df.sum(axis=1)

0    24.23
1    45.20
2    36.34
3    51.34
4    59.50
dtype: float64

In [124]:
df.describe()

            Age    Rating
count   5.00000  5.000000
mean   37.80000  5.522000
std    13.38656  1.303043
min    20.00000  4.230000
25%    30.00000  4.500000
50%    40.00000  5.200000
75%    44.00000  6.340000
max    55.00000  7.340000

In [128]:
df['Age'].describe()

count     5.00000
mean     37.80000
std      13.38656
min      20.00000
25%      30.00000
50%      40.00000
75%      44.00000
max      55.00000
Name: Age, dtype: float64

In [129]:
df.Name.str.len()

0    6
1    6
2    6
3    5
4    6
Name: Name, dtype: int64

In [134]:
df.Name.str.upper()  #converting into upper lower and lower case

0    GANESH
1    NILESH
2    RAKESH
3     BIBIN
4    KALPAK
Name: Name, dtype: object

In [140]:
df.Name.str.islower()

0    True
1    True
2    True
3    True
4    True
Name: Name, dtype: bool

In [142]:
df.Name.str.swapcase()

0    GANESH
1    NILESH
2    RAKESH
3     BIBIN
4    KALPAK
Name: Name, dtype: object

In [143]:
df

     Name  Age  Rating
0  ganesh   20    4.23
1  nilesh   40    5.20
2  rakesh   30    6.34
3   bibin   44    7.34
4  kalpak   55    4.50

In [147]:
#df.Age.str.isnumeric()  error

In [150]:
s=pd.Series(['tom','harry','rahul','alber@t'])
df=pd.DataFrame(s)
df

         0
0      tom
1    harry
2    rahul
3  alber@t

In [151]:
s.str.get_dummies()

   alber@t  harry  rahul  tom
0        0      0      0    1
1        0      1      0    0
2        0      0      1    0
3        1      0      0    0

In [154]:
s.str.contains('@')  #true or false

0    False
1    False
2    False
3     True
dtype: bool

In [155]:
s.str.replace('@','$')

0        tom
1      harry
2      rahul
3    alber$t
dtype: object

In [157]:
s.str.repeat(3)

0                tomtomtom
1          harryharryharry
2          rahulrahulrahul
3    alber@talber@talber@t
dtype: object

In [159]:
s.str.count('r')

0    0
1    2
2    1
3    1
dtype: int64

In [160]:
s.str.startswith('t')

0     True
1    False
2    False
3    False
dtype: bool

In [163]:
s.str.endswith('t')   #ends and strats ...write s

0    False
1    False
2    False
3     True
dtype: bool

In [167]:
s.str.findall('r')

0        []
1    [r, r]
2       [r]
3       [r]
dtype: object